Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

In [8]:
data=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]
df1=pd.DataFrame(data=data,columns=['Name','Age','Gender'])

In [9]:
df1.head(2) # print first n rows

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [10]:
df1.tail(3) # print last n rows

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
df1.columns # print out all the columns of the dataset

Index(['Name', 'Age', 'Gender'], dtype='object')

In [12]:
df1.describe() # provides some basic statistical measures

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [13]:
df1.dtypes # data types of the variables

Name      object
Age        int64
Gender    object
dtype: object

<br>
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
df=pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9],[11,12,13]],columns=['A','B','C'])

In [3]:
df

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  11  12  13

In [4]:
len(df)

4

In [5]:
def incr_3(x):
    mylist=[]
    for i in range(x,len(df)+1):
            mylist.append(x)
            x+=2
    return mylist

In [6]:
df.index=incr_3(1)

In [7]:
df

    A   B   C
1   1   2   3
3   4   5   6
5   7   8   9
7  11  12  13

<br>
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
df3=pd.DataFrame(data=[10,20,30,40,50],columns=['Values'])

In [9]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [10]:
def sum_data():
    x=df3[0:3].sum()
    return x

In [11]:
sum_data()

Values    60
dtype: int64

<br>
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
df4=pd.DataFrame(data=["You have a Pandas DataFrame df", "with a column named 'Values'", "Write a Python function that iterates over the DataFrame", "and calculates the sum of the first three values in the 'Values' column", "The function should print the sum to the console. For example, if", "the 'Values' column of df contains the values your function should calculate and print", "the sum of the first three values, which is 60"],columns=['Text'])

In [13]:
df4

                                                Text
0                     You have a Pandas DataFrame df
1                       with a column named 'Values'
2  Write a Python function that iterates over the...
3  and calculates the sum of the first three valu...
4  The function should print the sum to the conso...
5  the 'Values' column of df contains the values ...
6     the sum of the first three values, which is 60

In [14]:
text=list(df4['Text'])
word_count=[]
for words in text:
    word_list=words.split(' ')
    count=len(word_list)
    word_count.append(count)
df4['Word_Count']=word_count

In [15]:
df4

                                                Text  Word_Count
0                     You have a Pandas DataFrame df           6
1                       with a column named 'Values'           5
2  Write a Python function that iterates over the...           9
3  and calculates the sum of the first three valu...          13
4  The function should print the sum to the conso...          12
5  the 'Values' column of df contains the values ...          14
6     the sum of the first three values, which is 60          10

<br>
Q5. How are DataFrame.size() and DataFrame.shape() different?

Syntax: dataframe.size <br>
Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
<br>
Syntax: dataframe.shape <br>
Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [16]:
df4.size

14

In [17]:
df4.shape

(7, 2)

<br>
Q6. Which function of pandas do we use to read an excel file?

pd.read_excel("abc.xlsx")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [18]:
df7=pd.DataFrame(data=["msusa@comcast.net"
,"stomv@optonline.net"
,"carroll@aol.com"
,"csilvers@aol.com"
,"dimensio@me.com"
,"andale@live.com"
,"hamilton@mac.com"
,"bradl@outlook.com"
,"sbmrjbr@live.com"
,"engelen@gmail.com"
,"rnewman@optonline.net"
,"dwendlan@yahoo.ca"],columns=['Email'])

In [19]:
df7

                    Email
0       msusa@comcast.net
1     stomv@optonline.net
2         carroll@aol.com
3        csilvers@aol.com
4         dimensio@me.com
5         andale@live.com
6        hamilton@mac.com
7       bradl@outlook.com
8        sbmrjbr@live.com
9       engelen@gmail.com
10  rnewman@optonline.net
11      dwendlan@yahoo.ca

In [20]:
def extract_username():
    email=list(df7['Email'])
    username=[]
    for elts in email:
        username.append(elts.split('@')[0])
    return username

In [21]:
df7=df7.assign(Username=extract_username())

In [22]:
df7

                    Email  Username
0       msusa@comcast.net     msusa
1     stomv@optonline.net     stomv
2         carroll@aol.com   carroll
3        csilvers@aol.com  csilvers
4         dimensio@me.com  dimensio
5         andale@live.com    andale
6        hamilton@mac.com  hamilton
7       bradl@outlook.com     bradl
8        sbmrjbr@live.com   sbmrjbr
9       engelen@gmail.com   engelen
10  rnewman@optonline.net   rnewman
11      dwendlan@yahoo.ca  dwendlan

<br>
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2


Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [23]:
df8=pd.DataFrame(data=[[3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]],columns=list("ABC"))

In [24]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
df8[(df8['A']>5) & (df8['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [26]:
df9=pd.DataFrame(data=[23,23,45,56,67],columns=['Values'])

In [27]:
df9

   Values
0      23
1      23
2      45
3      56
4      67

In [28]:
df9.mean()

Values    42.8
dtype: float64

In [29]:
df9.median()

Values    45.0
dtype: float64

In [30]:
df9.std()

Values    19.677398
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [31]:
df10=pd.DataFrame(data=[['2022-06-22',12],['2022-06-23',32],['2022-06-24',334],['2022-06-25',97],['2022-06-26',543],['2022-06-27',12],['2022-06-28',322],['2022-06-29',32]],columns=['Date','Value'])

In [32]:
df10['Date']=pd.to_datetime(df10['Date'])

In [33]:
df10

        Date  Value
0 2022-06-22     12
1 2022-06-23     32
2 2022-06-24    334
3 2022-06-25     97
4 2022-06-26    543
5 2022-06-27     12
6 2022-06-28    322
7 2022-06-29     32

In [34]:
df10['MovingAverage']=df10['Value'].rolling(window=7).mean()

In [35]:
df10

        Date  Value  MovingAverage
0 2022-06-22     12            NaN
1 2022-06-23     32            NaN
2 2022-06-24    334            NaN
3 2022-06-25     97            NaN
4 2022-06-26    543            NaN
5 2022-06-27     12            NaN
6 2022-06-28    322     193.142857
7 2022-06-29     32     196.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [36]:
df11=pd.DataFrame(data=['2023-01-01',  '2023-01-02', '2023-01-03' , '2023-01-04','2023-01-05'],columns=['Date'])

In [37]:
df11['Date']=pd.to_datetime(df11['Date'])

In [38]:
df11['Weekday']=df11['Date'].dt.day_name()

In [39]:
df11

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [3]:
df12=pd.DataFrame(data=['2023-01-02 09:15:00','2023-03-02 15:25:02','2023-03-02 15:45:00','2023-01-02 05:55:00','2023-03-02 05:55:00'],columns=['Date'])
df12

                  Date
0  2023-01-02 09:15:00
1  2023-03-02 15:25:02
2  2023-03-02 15:45:00
3  2023-01-02 05:55:00
4  2023-03-02 05:55:00

In [4]:
import pandas as pd

def select_rows_between_dates(df12):
    # Convert 'Date' column to pandas datetime format
    df12['Date'] = pd.to_datetime(df12['Date'])

    # Select rows where 'Date' is between '2023-01-01' and '2023-01-31'
    mask = (df12['Date'] >= '2023-01-01') & (df12['Date'] <= '2023-01-31')
    filtered_df = df12.loc[mask]

    return filtered_df

In [109]:
select_rows_between_dates(df12)

                 Date
0 2023-01-02 09:15:00
3 2023-01-02 05:55:00

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Pandas library needs to be imported
#import pandas as pd